In [1]:
#importing python library
import pandas as pd
import numpy as np

In [2]:
#dataFrame will have its index assigned automatically,
#the columns are placed in a sorted order
data = {'sate':['ohi','ohi','ohi','nevada','nevada','nevada'],'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)
#using the Jupyter notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.
frame

     sate  year  pop
0     ohi  2000  1.5
1     ohi  2001  1.7
2     ohi  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [3]:
#head method selets only first five rows
frame.head()

     sate  year  pop
0     ohi  2000  1.5
1     ohi  2001  1.7
2     ohi  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [4]:
#specify a sequence of columns
pd.DataFrame(data,columns=['year','sate','pop'])

   year    sate  pop
0  2000     ohi  1.5
1  2001     ohi  1.7
2  2002     ohi  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [5]:
#If you pass a column that isn't contained in the dict,it will appear with missing values in the result
frame2=pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year state  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
three  2002   NaN  3.6  NaN
four   2001   NaN  2.4  NaN
five   2002   NaN  2.9  NaN
six    2003   NaN  3.2  NaN

In [6]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [7]:
#A column in a DataFrame can be retrieved as a series either by dict-like notation or by attribute
frame2['state']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: state, dtype: object

In [8]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [9]:
#rows can be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
state     NaN
pop       3.6
debt      NaN
Name: three, dtype: object

In [10]:
#columns can be modified by assignment
#'debt' column could be assigned a scolar value or an array of values
frame2['debt'] = 16.5
frame2

       year state  pop  debt
one    2000   NaN  1.5  16.5
two    2001   NaN  1.7  16.5
three  2002   NaN  3.6  16.5
four   2001   NaN  2.4  16.5
five   2002   NaN  2.9  16.5
six    2003   NaN  3.2  16.5

In [11]:
frame2['debt'] = np.arange(6.)
frame2

       year state  pop  debt
one    2000   NaN  1.5   0.0
two    2001   NaN  1.7   1.0
three  2002   NaN  3.6   2.0
four   2001   NaN  2.4   3.0
five   2002   NaN  2.9   4.0
six    2003   NaN  3.2   5.0

In [12]:
#assign a series, its labels will be realigned exactly to the DataFrame's index,inserting missing values in any holes
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt']=val
frame2

       year state  pop  debt
one    2000   NaN  1.5   NaN
two    2001   NaN  1.7  -1.2
three  2002   NaN  3.6   NaN
four   2001   NaN  2.4  -1.5
five   2002   NaN  2.9  -1.7
six    2003   NaN  3.2   NaN

In [13]:
#add a new column of boolean values where the state column equals 'ohilo'
frame2['eastern']=frame2.state=='0hio'
frame2

       year state  pop  debt  eastern
one    2000   NaN  1.5   NaN    False
two    2001   NaN  1.7  -1.2    False
three  2002   NaN  3.6   NaN    False
four   2001   NaN  2.4  -1.5    False
five   2002   NaN  2.9  -1.7    False
six    2003   NaN  3.2   NaN    False

In [14]:
#the del method can then be used to remove this colum
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [15]:
#data is a nested dic of dicts
pop = {'nevada':{2002:2.4 ,2002: 2.9},'ohio':{2000: 1.5,2001: 1.7,2002: 3.6}}
frame3=pd.DataFrame(pop)
frame3

      nevada  ohio
2002     2.9   3.6
2000     NaN   1.5
2001     NaN   1.7

In [16]:
#Transpose the DataFrame
frame3.T

        2002  2000  2001
nevada   2.9   NaN   NaN
ohio     3.6   1.5   1.7

In [17]:
#Sorted to form the index in the result
pd.DataFrame(pop,index=[2001, 2002, 2003])

      nevada  ohio
2001     NaN   1.7
2002     2.9   3.6
2003     NaN   NaN

In [18]:
#DataFrame's index and colummns have their name attribute set 
frame3.index.name = 'year'; frame3.columns.name='state'
frame3

state  nevada  ohio
year
2002      2.9   3.6
2000      NaN   1.5
2001      NaN   1.7

In [19]:
#values attribute returns the data contained in the DataFrame as a Two-dimensional ndarray
frame3.values

array([[2.9, 3.6],
       [nan, 1.5],
       [nan, 1.7]])

In [20]:
frame2.values

array([[2000, nan, 1.5, nan],
       [2001, nan, 1.7, -1.2],
       [2002, nan, 3.6, nan],
       [2001, nan, 2.4, -1.5],
       [2002, nan, 2.9, -1.7],
       [2003, nan, 3.2, nan]], dtype=object)